icprog/PIC_Related/XC8Projects/16F18855/ks0108-6.X/HiTech GLCD for pic18f4680.h
unsigned char Matrix[98][8]=	{
															{0x20, 2, 0x00, 0x00},													// Espace
															{0x21, 2, 0x4f, 0x00},													// !
															{0x22, 4, 0x07, 0x00, 0x07, 0x00},							// "
															{0x23, 6, 0x14, 0x7f, 0x14, 0x7f, 0x14, 0x00},	// #
															{0x24, 6, 0x24, 0x2a, 0x7f, 0x2a, 0x12, 0x00},	// $
															{0x25, 6, 0x23, 0x13, 0x08, 0x64, 0x62, 0x00},	// %
															{0x26, 6, 0x36, 0x49, 0x55, 0x22, 0x20, 0x00},	// &
															{0x27, 3, 0x05, 0x03, 0x00},										// '
															{0x28, 4, 0x1c, 0x22, 0x41, 0x00},							// (
															{0x29, 4, 0x41, 0x22, 0x1c, 0x00},							// )10
															{0x2A, 6, 0x14, 0x08, 0x3e, 0x08, 0x14, 0x00},	// * 
															{0x2B, 6, 0x08, 0x08, 0x3e, 0x08, 0x08, 0x00},	// +
															{0x2C, 2, 0xc0, 0x00},													// , 
															{0x2D, 6, 0x08, 0x08, 0x08, 0x08, 0x08, 0x00},	// -
															{0x2E, 2, 0x40, 0x00},													// .
															{0x2F, 6, 0x20, 0x10, 0x08, 0x04, 0x02, 0x00},	// /
															{0x30, 6, 0x3e, 0x51, 0x49, 0x45, 0x3e, 0x00},	// 0
															{0x31, 4, 0x42, 0x7f, 0x40, 0x00}, 							// 1
															{0x32, 6, 0x42, 0x61, 0x51, 0x49, 0x46, 0x00},	// 2
															{0x33, 6, 0x21, 0x41, 0x45, 0x4b, 0x31, 0x00},	// 320
															{0x34, 6, 0x18, 0x14, 0x12, 0x7f, 0x10, 0x00},	// 4 
															{0x35, 6, 0x27, 0x45, 0x45, 0x45, 0x39, 0x00},	// 5
															{0x36, 6, 0x3c, 0x4a, 0x49, 0x49, 0x30, 0x00},	// 6
															{0x37, 6, 0x01, 0x71, 0x09, 0x05, 0x03, 0x00},	// 7
															{0x38, 6, 0x36, 0x49, 0x49, 0x49, 0x36, 0x00},	// 8
															{0x39, 6, 0x06, 0x49, 0x49, 0x29, 0x1e, 0x00},	// 9
															{0x3A, 3, 0x36, 0x36, 0x00},										// :
															{0x3B, 3, 0x56, 0x36, 0x00},										// ;
															{0x3C, 5, 0x08, 0x14, 0x22, 0x41, 0x00}, 			// <
															{0x3D, 6, 0x14, 0x14, 0x14, 0x14, 0x14, 0x00},	// =30
															{0x3E, 5, 0x41, 0x22, 0x14, 0x08, 0x00}, 			// > 
															{0x3F, 6, 0x02, 0x01, 0x51, 0x09, 0x06, 0x00},	// ?
															{0x40, 6, 0x3e, 0x41, 0x5d, 0x55, 0x1e, 0x00},	// @ 0x40
															{0x41, 6, 0x7e, 0x11, 0x11, 0x11, 0x7e, 0x00},	// A
															{0x42, 6, 0x7f, 0x49, 0x49, 0x49, 0x36, 0x00},	// B
															{0x43, 6, 0x3e, 0x41, 0x41, 0x41, 0x22, 0x00},	// C
															{0x44, 6, 0x7f, 0x41, 0x41, 0x41, 0x3e, 0x00},	// D
															{0x45, 6, 0x7f, 0x49, 0x49, 0x49, 0x41, 0x00},	// E
															{0x46, 6, 0x7f, 0x09, 0x09, 0x09, 0x01, 0x00},	// F
															{0x47, 6, 0x3e, 0x41, 0x49, 0x49, 0x7a, 0x00},	// G40
															{0x48, 6, 0x7f, 0x08, 0x08, 0x08, 0x7f, 0x00},  // H 
															{0x49, 4, 0x41, 0x7f, 0x41, 0x00},  						// I
															{0x4A, 6, 0x20, 0x40, 0x41, 0x3f, 0x01, 0x00},	// J
															{0x4B, 6, 0x7f, 0x08, 0x14, 0x22, 0x41, 0x00},	// K
															{0x4C, 6, 0x7f, 0x40, 0x40, 0x40, 0x40, 0x00},	// L
															{0x4D, 6, 0x7f, 0x02, 0x0c, 0x02, 0x7f, 0x00},	// M
															{0x4E, 6, 0x7f, 0x04, 0x08, 0x10, 0x7f, 0x00},	// N
															{0x4F, 6, 0x3e, 0x41, 0x41, 0x41, 0x3e, 0x00},	// O
															{0x50, 6, 0x7f, 0x11, 0x11, 0x11, 0x0E, 0x00},	// P 0x50
															{0x51, 6, 0x3e, 0x41, 0x51, 0x21, 0x5e, 0x00},	// Q50
															{0x52, 6, 0x7f, 0x09, 0x19, 0x29, 0x46, 0x00},	// R 
															{0x53, 6, 0x26, 0x49, 0x49, 0x49, 0x32, 0x00},	// S
															{0x54, 6, 0x01, 0x01, 0x7f, 0x01, 0x01, 0x00},	// T
															{0x55, 6, 0x3f, 0x40, 0x40, 0x40, 0x3f, 0x00},	// U
															{0x56, 6, 0x1f, 0x20, 0x40, 0x20, 0x1f, 0x00},	// V
															{0x57, 6, 0x3f, 0x40, 0x38, 0x40, 0x3f, 0x00},	// W
															{0x58, 6, 0x63, 0x14, 0x08, 0x14, 0x63, 0x00},	// X
															{0X59, 6, 0x07, 0x08, 0x70, 0x08, 0x07, 0x00},	// Y
															{0X5A, 6, 0x61, 0x51, 0x49, 0x45, 0x43, 0x00},	// Z
															{0x5B, 4, 0x7f, 0x41, 0x41, 0x00},  						// [60
															{0x5C, 6, 0x02, 0x04, 0x08, 0x10, 0x20, 0x00},	// \ 
															{0x5D, 4, 0x41, 0x41, 0x7f, 0x00},  						// ]
															{0x5E, 6, 0x04, 0x02, 0x01, 0x02, 0x04, 0x00},	// ^
															{0x5F, 6, 0x40, 0x40, 0x40, 0x40, 0x40, 0x00},	// _
															{0x60, 3, 0x03, 0x05, 0x00},										// ` 0x60
															{0x61, 6, 0x20, 0x54, 0x54, 0x54, 0x78, 0x00},	// a
															{0x62, 6, 0x7F, 0x44, 0x44, 0x44, 0x38, 0x00},	// b
															{0x63, 6, 0x38, 0x44, 0x44, 0x44, 0x44, 0x00},	// c
															{0x64, 6, 0x38, 0x44, 0x44, 0x44, 0x7f, 0x00},	// d
															{0x65, 6, 0x38, 0x54, 0x54, 0x54, 0x18, 0x00},	// e70
															{0x66, 6, 0x04, 0x04, 0x7e, 0x05, 0x05, 0x00},	// f 
															{0x67, 6, 0x08, 0x54, 0x54, 0x54, 0x3c, 0x00},	// g
															{0x68, 6, 0x7f, 0x08, 0x04, 0x04, 0x78, 0x00},	// h
															{0x69, 4, 0x44, 0x7d, 0x40, 0x00},  						// i
															{0x6A, 5, 0x20, 0x40, 0x44, 0x3d, 0x00}, 			// j
															{0x6B, 5, 0x7f, 0x10, 0x28, 0x44, 0x00}, 				// k
															{0x6C, 4, 0x41, 0x7f, 0x40, 0x00},  						// l
															{0x6D, 6, 0x7c, 0x04, 0x7c, 0x04, 0x78, 0x00},	// m
															{0x6E, 6, 0x7c, 0x08, 0x04, 0x04, 0x78, 0x00},	// n
															{0x6F, 6, 0x38, 0x44, 0x44, 0x44, 0x38, 0x00},	// o80
															{0x70, 6, 0x7c, 0x14, 0x14, 0x14, 0x08, 0x00},	// p 0x70 
															{0x71, 6, 0x08, 0x14, 0x14, 0x14, 0x7c, 0x00},	// q
															{0x72, 5, 0x7c, 0x08, 0x04, 0x04, 0x00}, 			// r
															{0x73, 6, 0x48, 0x54, 0x54, 0x54, 0x24, 0x00},	// s
															{0x74, 6, 0x04, 0x04, 0x3f, 0x44, 0x44, 0x00},	// t
															{0x75, 6, 0x3c, 0x40, 0x40, 0x20, 0x7c, 0x00},	// u
															{0x76, 6, 0x1c, 0x20, 0x40, 0x20, 0x1c, 0x00},	// v
															{0x77, 6, 0x3c, 0x40, 0x30, 0x40, 0x3c, 0x00},	// w
															{0x78, 6, 0x44, 0x28, 0x10, 0x28, 0x44, 0x00},	// x
															{0x79, 6, 0x0c, 0x50, 0x50, 0x50, 0x3c, 0x00},	// y90
															{0x7A, 6, 0x44, 0x64, 0x54, 0x4c, 0x44, 0x00},	// z 
															{0x7B, 5, 0x08, 0x36, 0x41, 0x41, 0x00}, 			// {
															{0x7C, 2, 0x77, 0x00},													// |
															{0x7D, 5, 0x41, 0x41, 0x36, 0x08, 0x00}, 			// }
															{0x7E, 6, 0x08, 0x08, 0x2a, 0x1c, 0x08, 0x00},	// <-
															{0x7F, 6, 0x08, 0x1c, 0x2a, 0x08, 0x08, 0x00},	// ->
															{0x80, 6, 0xff, 0xff, 0xff, 0xff, 0xff, 0x00},			//  0x80 - might be used like curor
															{0xe6, 6, 0x1c, 0x22, 0x62, 0xa2, 0x22, 0x00}
															};


// Some declarations of functions
#include <xc.h>
#include "system.h"

