icprog/PIC_Related/XC8Projects/16F18855/ks0108-6.X/HiTech GLCD for pic18f4680.h
#define CS1         LATBbits.LATB0
#define CS2         LATBbits.LATB1
#define DI          LATBbits.LATB2
#define RW          LATBbits.LATB3
#define E           LATBbits.LATB4
#define RS          LATBbits.LATB5


extern void Reset_GLCD(void);
extern void Enable(void);
extern void Active_Left(void);
extern void Active_Right(void);
extern void Starting_Address(unsigned int S);
extern unsigned int Y_Address(unsigned int Y);
extern unsigned int X_Address(unsigned int X);
extern void Display_ON(void);
extern void Display_OFF(void);
extern void Clear_Display(void);
extern void Write_Byte(unsigned char B);
extern void Text_GLCD(unsigned int Row, unsigned int Column, const char *String);
extern void TextBuff_GLCD(unsigned int Row, unsigned int Column, unsigned char Buff_String[]);


//	Temporary buffer for GLCD row.

unsigned char Buffer[128];


/*

Function: void Text_GLCD(unsigned char Row,  unsigned char Column,  unsigned char *String)

		Link for the explanation of how GLCD with KS0108 works: http://www.geocities.com/dinceraydin/lcd/gfxintro.htm.

		Idea is to fill the buffer 128 bytes long with the bit-maps of characters. The buffer represents one row for both controllers: 0-63 bytes for the left one and 64-127 bytes for the right.
		When buffer is completed transfer all 128 bytes to controllers: first in the left and than in the right.
		The way to transfer bytes is: first enable left controller and disable right, fill the first 64 bytes from buffer, disable left and enable right controller and fill the rest 64 bytes from buffer.
		If the text starts at some offset from the beginning of row (column that is not the zero-column), than first the buffer will be filled with NULL (0x00), than will be filled with the bit-maps of characters of text and the remaning space (if there is some) will be filled with NULL again. NULL´s are necessary if there is some previous text on the desired row. 
		Why to do this? Because author concluded that this is the fastest way the controller shows the text: prepare the whole row and than fill the controllers.
*/

void Text_GLCD(unsigned int Row, unsigned int Column, const char *String)
{
	unsigned char Char_In_String=0, Char_In_Matrix=0;
	unsigned int k=0, Place_In_Buffer=0, Index=0, Counter=0;

	while(Place_In_Buffer<=Column)			// First, fill NULL's from the beginning of row to the starting column of text. If Column==0 this while-loop will be skipped.
	{
		Buffer[Place_In_Buffer]=0x00;		// The pointer Place_In_Buffer is the pointer for the buffer. It always increments untill it reaches the end of the buffer (127).
		Place_In_Buffer++;					// Increment pointer.
	}

//Searching the text string to find the match of the character.

	while(String[Char_In_String]!=0x00)			// Untill reach the end of the text string 0x00...
	{
		for(Char_In_Matrix=0;Char_In_Matrix<=96;Char_In_Matrix++)	// ... iterate across the matrix Matrix[97][8] incremening the indeks Char_In_Matrix untill we find the match: the character.
		{
			if(String[Char_In_String]==Matrix[Char_In_Matrix][0])		// When we find the character (it`s code is at place Matrix[Char_In_Matrix][0] – column zero)...
			{
				Counter=2;			// ... and initialize the Counter to point to the first byte of the character`s bit-map: Matrix[Char_In_Matrix][Counter]	and that is the column two.
				for(k=1;k<=Matrix[Char_In_Matrix][1];k++)	// From the place that pointer Char_In_Matrix points to Matrix[][] and from the column one from matrix Matrix[][], take the number that represents the WIDTH (IN	BYTES) OF CHARACTER. THIS IS THE UPPER LIMIT FOR THIS FOR-LOOP. THIS NUMBER CAN BE MAXIMUM 5 (FIVE - LOOK AT THE TOP IN THE MATRIX!).		
				{
					Buffer[Place_In_Buffer]=Matrix[Char_In_Matrix][Counter];	// Now we are writting bytes at buffer pointer Place_In_Buffer, one by one into buffer from the index Matrix[Char_In_Matrix][Counter]...
					Counter++;				// ... move to the next byte of character`s bit-map in the matrix...
					Place_In_Buffer++;	// ... and increment buffer pointer to point to next place in buffer untill we fill the desired bytes of the character.
				}
			}
		}
	if(Place_In_Buffer>=127) break;	// But, if the number of bytes overflow the right limit of the GLCD in one row (128) we quit flling the buffer! Go to the next character in string.
	Char_In_String++;										
	}								

	while(Place_In_Buffer<128)			// But, if the number of bytes is less than the right limit of the GLCD and there is no characters in string...
	{
		Buffer[Place_In_Buffer]=0x00;	//... fill the remainig text buffer space with NULL`s up to the right limit (128).
		Place_In_Buffer++;
	}
	
//After we finished with the buffer, we start to write in to the controllers. First, in the left controller.

	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xC0;						// Instruction for the starting address: 0b11000000 - it is the top of the display...
		Enable();						//... and, of course, rise ENABLE.
		CS1=1;	// Pin RB3 (CS1) is going on logical 1 to switch ON left controller... 			Pogledaj napomenu na dnu strane!
		CS2=0;	// ... and RB2 (CS2) is going on logical 0 to switch OFF right controller...
			Enable();					// ... and, of course, rise ENABLE for starting address to be written.

	LATC=0xB8;			// Now, we are writting byte of the instruction for the row in which we are going to write: 0b10111000...
	LATC+=Row;		// ... whom we add the starting row from the top of display...
		Enable();			// ... and, of course, rise ENABLE for X-address to be written.

	LATC=0x40;			// After that, we are writting the instruction for the Y-address – the starting column in which we are going to write: 0b01000000 – the column zero...
		Enable();			// ... and, of course, rise ENABLE for Y-address to be written.

	DI=1;		// Now, we are going to write bytes in GLCD, so pin D/I (data/instruction) is going on logical 1: data.

	for(Index=0;Index<=63;Index++)
	{
		LATC=Buffer[Index];		// We are taking one by one byte from buffer Buffer[] from place Buffer[Index] and write it in port D...
		Enable();							// ... and, of course, rise ENABLE for data to be written in GLCD.
// NOTE: everytime the byte is written, controller by himself increments the Y-address by one so we don`t need to increment the Y-address!
	}

//Continuing to write, but now in the right controller.

	DI=0;			// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;			// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xC0;							// Again, instruction for the starting address: 0b11000000 - it is the top of the display...
		Enable();							//... and, of course, rise ENABLE.
	 		CS1=0;	// Pin RB3 (CS1) is going on logical 0 to switch OFF left controller...
			CS2=1;	// ... and RB2 (CS2) is going on logical 1 to switch ON right controller...
			Enable();						// ... and, of course, rise ENABLE for starting address to be written.

	LATC=0xB8;					// Again, we are writting byte of the instruction for the row in which we are going to write: 0b10111000...
	LATC+=Row;				// ... whom we add the starting row from the top of display...
		Enable();					// ... and, of course, rise ENABLE for X-address to be written.

	LATC=0x40;				// After that, we are writting the instruction for the Y-address – the sarting column in which we are going to 	write: 0b01000000 – the column zero...
		Enable();				// ... and, of course, rise ENABLE for Y-address to be written.

	DI=1;		// Now, we are going to write bytes in GLCD, so pin D/I (data/instruction) is going on logical 1: data.
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting (just in case).

