icprog/PIC_Related/XC8Projects/16F18855/ks0108-6.X/HiTech GLCD for pic18f4680.h
	  for(Index=64;Index<128;Index++)
	  {
		LATC=Buffer[Index];		// Again, we are taking one by one byte from buffer Buffer[] from place Buffer[Index] and write it in port D...
		Enable();							// ... and, of course, rise ENABLE for data to be written in GLCD.
	  }
	  LATB=0b10000000;		// This line is specially for my EasyPIC3 for port B. It prevents the corresponding diodes not to light, but the 	GLCD is still showing the data (remember: bit 8 must be ON during the whole time the GLCD is used).
	  LATC=0;							// Like the line before, for port D to stay OFF.
}
//******************************End of function void Text_GLCD(unsigned char Row,  unsigned char Column,  unsigned char *String)




/*
******************************************************************************
Function: void Enable (void)

		This function manage the ENABLE signal for GLCD ("action" ?). Input on my board (EasyPIC3) is connected to pin RB6 of port B (see the picture in the addenum). The action is achieved in the sequence 0-1-0. Falling edge is taking action.
*/
void Enable(void)
{
    E=1;				// Rise RB6 at logical 1...
	__delay_us(2);			// ... wait some time...
    E=0;			// ... than put down RB6 at logical 0 for the action to be taken.
}


/*
*******************************************************************************
Function: void Reset_GLCD (void)

		This function do two things: initialises GLCD by reseting it by it`s pin RS and switch ON both sides of display.
		On my EasyPIC3 this pins are connected on pins RB2, RB3 and RB7 of port B (see picture in addenum). Reset is achieved by sequence 1-0-1 on pin RB7. Swtching controllers is achieved by using pins RB2 and RB3.
Attention: From this moment (or after reset) pin RB7 MUST ALWAYS stay on logical 1 (one) during the whole time the GLCD is used!
*/

void Reset_GLCD(void)
{
// Part ONE: resetting the display.

LATB=0b10000000;			// Rise RB7 to logical 1 for GLCD to evntually do something...
LATC=0x00;							// ...and then clear port D.
	RS=0;		// Set down RB7 to prepare it for action...
	__delay_us(2);		// ... wait some time...	
	RS=1;		//... and action! GLCD is resetted.
	
// Part TWO: Activating both controllers.

TRISC=0xFF;							// Put port D to be input port.
	RW=1;			// Rise RB5 at logical 1 – this is the instruction for reading the status of GLCD...
	Enable();								// ...and ENABLE GLCD to get the status on port D.
	while(E)	// Checking: untill LATC4 is high there is internall operation in GLCD an it does not receive data.
		CS1=1;		// ... and rise pins CS1 i CS2 to high because we want to activate both controllers...
		CS2=1;
		Enable();							// ... and ENABLE to say it to GLCD.
TRISC=0x00;							// Than, put port D to be out port.
}
//******************* End of function Reset_GLCD()



/*
********************************************************************
Function: void Active_Left(void)

		This function activates the left side of GLCD. Actually, it only activates the left controller and enable it to receive characters.
*/

void Active_Left(void)
{
	DI=0;			// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;			// ... and R/W pin (read/write) at logical 0: writting.
		CS1=1;		// Pin RB3 (CS1) is going on logical 1 to switch ON left controller......
		CS2=0;		// ... and pin RB2 (CS2) is going on logical 0 to switch OFF right controller...
		Enable();							// ... and, of course, rise ENABLE.
}
//******************* End of function Active_Left()



/*
******************************************************************
Function: void Active_Right(void)

		This function activates the right side of GLCD. Actually, it only activates the right controller and enable it to receive characters.
*/
void Active_Right(void)
{
	DI=0;			//Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;			// ... and R/W pin (read/write) at logical 0: writting.
		CS1=0;		// Pin RB3 (CS1) is going on logical 0 to switch OFF left controller......
		CS2=1;		// ... and pin RB2 (CS2) is going on logical 1 to switch ON right controller...
		Enable();							// ... and, of course, rise ENABLE.
}
//******************* End of function Aktive_Right()



/*
******************************************************************
Function: void Starting_Address(unsigned int S)

		This function is mostly like SHIFT function. Works in that way that the given line of GLCD controller (not the given row) is shifted to the line zero or to the top of display. Or, much closer: if we want for ex. line 35 to move to the top of display we put the parameter S to be 35. Then, the line will "slide" to top of display. The lines that are dissapeared above this line are not lost: they will appear at the bottom of display.

		Note: This function will perform only on active controller! So, if we want the hole line to be moved we must activate the both controllers.
*/
void Starting_Address(unsigned int S)
{
	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xC0;						// Instruction for the starting address: 0b11000000 - it is the top of the display...
		LATC+=S;						// ... and add the offset from the top of display...
		Enable();						// ... and, of course, rise ENABLE for starting address to be written.
}
//********************End of function void Starting_Address(usigned char S)



/*
**********************************************************************
Function: unsigned int Y_Address(unsigned int Y)

		This function puts the character at the column from the left edge of display (the horizontal address).
*/

unsigned int Y_Address(unsigned int Y)
{
	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0x40;						// Instruction for the Y-address: 0b0100000- it is the left edge of the controller...
		LATC+=Y;						// ... and add the offset from the left edge of controller...
		Enable();						// ... and, of course, rise ENABLE for Y-address to be written.
	return Y;							// return Y if someone needs it.
}
//********************End of function unsigned char Y_Address(usigned char Y)



