icprog/PIC_Related/XC8Projects/16F18855/ks0108-6.X/HiTech GLCD for pic18f4680.h
/*
*****************************************************************************
Function: unsigned int X_Address(unsigned int X)

		This function puts the character at the row from the top edge of display (the vertical address).
*/

unsigned int X_Address(unsigned int X)
{
	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xB8;						// Instruction for the X-address: 0b10111000- it is the left edge of the controller...
		LATC+=X;						// ... and add the offset from the left edge of controller...
		Enable();						// ... and, of course, rise ENABLE for Y-address to be written.
	return X;							// return X if someone needs it.
}
//********************End of function unsigned char X_Address(usigned char X)



/*
******************************************************************
Function: void Display_ON(void)

		Obviosly, this function only swtches the GLCD ON.
*/

void Display_ON(void)
{
	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0x3F;						// Instruction for the display to turn on: 0b00111111...
		Enable();						// ... and, of course, rise ENABLE to turn display ON.
}
//********************End of function void Display_ON(void)



/*
***************************************************
Function: void Display_OFF(void)

		Obviosly, this function only swtches the GLCD OFF.
*/

void Display_OFF(void)
{
	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0x3E;						// Instruction for the display to turn off: 0b00111110...
		Enable();						// ... and, of course, rise ENABLE to turn display OFF.
}
//********************End of function void Display_OFF(void)



/*
****************************************************
Function: void Write_Byte(unsigned char B)

		I think that function is self explanatory...
*/

void Write_Byte(unsigned char B)
{
	DI=1;		// Put pin D/I (data/instruction) at logical 1: data...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=B	;							// Put byte (data) on port B to be written to GLCD...
		Enable();						// ... and, of course, rise ENABLE to write byte in GLCD.
}
//********************End of function void Write_Byte(unsigned char B)



/*
****************************************
Function void Clear_Display(void)

		Function clears the GLCD by writting the NULL`s to both sides of display (to both controllers) from top to down (outer for-loop) and from top to the left (the inner for-loop).
*/

void Clear_Display(void)
{
	unsigned char i, j;				// First, we defined a pair of variables for for-loops for incremnts of Y and X addresses.
		CS1=1;			// Pin RB3 (CS1) is going on logical 1 to switch ON left controller......
		CS2=1;			// ... and pin RB2 (CS2) is going on logical 1 to switch ON right controller...
			Enable();							// ... and, of course, rise ENABLE to switch them.
			Starting_Address(0);		// ... and starting address is 0,0.
			for(i=0;i<=7;i++)			// Strat from row zero and go to row 7 of both controllers (outer for-loop)...
			{
				X_Address(i);				// ...and "say" it to GLCD.
				for(j=0;j<=63;j++)		// Start the writting from the left-most column (column zero) to 63. column of both controllers (inner for-loop).
				{
				Write_Byte(0x00);		// Write NULL.
				}
			}
	
}
//*********************** End of function void Clear_Display(void)



/*

Function: void Text_GLCD(unsigned char Row,  unsigned char Column,  unsigned char Buff_String[])

		This function is almost identical with Text_GLCD(). Only difference is that this function writes the text from previous populated buffer Buff_String[] defined in RAM during the run time.

*/

void TextBuff_GLCD(unsigned int Row,  unsigned int Column, char Buff_String[])
{
	unsigned char Char_In_String=0, Char_In_Matrix=0;
	unsigned int k=0, Place_In_Buffer=0, Index=0, Counter=0;

	while(Place_In_Buffer<=Column)			// First, fill NULL's from the beginning of row to the starting column of text. If Column== 0 this while-loop will be skipped.
	{
		Buffer[Place_In_Buffer]=0x00;		// The pointer Place_In_Buffer is the pointer for the buffer. It always increments untill it reaches the end of the buffer (127).
		Place_In_Buffer++;					// Increment pointer.
	}

//Searching the text string to find the match of the character.

	while(Buff_String[Char_In_String]!=0x00)			// Untill reach the end of the text string 0x00...
	{
		for(Char_In_Matrix=0;Char_In_Matrix<=96;Char_In_Matrix++)	// ... iterate across the matrix Matrix[97][8] incremening the indeks Char_In_Matrix untill we find the match: the character.
		{
			if(Buff_String[Char_In_String]==Matrix[Char_In_Matrix][0])		// When we find the character (it`s code is at place  Matrix[Char_In_Matrix][0] – column zero)...
			{
				Counter=2;	// ... and initialize the Counter to point to the first byte of the character`s bit-map: Matrix[Char_In_Matrix][Counter]	and that is the column two.
				for(k=1;k<=Matrix[Char_In_Matrix][1];k++)	// From the place that pointer Char_In_Matrix points to Matrix[][] and from the column one from matrix Matrix[][], take the number that represents the WIDTH (IN	BYTES) OF CHARACTER. THIS IS THE UPPER LIMIT FOR THIS FOR-LOOP. THIS NUMBER CAN BE MAXIMUM 5 (FIVE - LOOK AT THE TOP IN THE MATRIX!).		
				{
					Buffer[Place_In_Buffer]=Matrix[Char_In_Matrix][Counter];	// Now we are writting bytes at buffer pointer Place_In_Buffer, one by	one into buffer from the index Matrix[Char_In_Matrix][Counter]...
					Counter++;				// ... move to the next byte of character`s bit-map in the matrix...
					Place_In_Buffer++;	// ... and increment buffer pointer to point to next place in buffer untill we fill the desired bytes of the character.
				}
			}
		}
	if(Place_In_Buffer>=127) break;	// But, if the number of bytes overflow the right limit of the GLCD in one row (128) we quit flling the buffer! Go to the next character in string.
	Char_In_String++;										
	}								

	while(Place_In_Buffer<128)			// But, if the number of bytes is less than the right limit of the GLCD and there is no characters in string...
	{
		Buffer[Place_In_Buffer]=0x00;	//... fill the remainig text buffer space with NULL`s up to the right limit (128).
		Place_In_Buffer++;
	}
	
