icprog/PIC_Related/XC8Projects/16F18855/ks0108-6.X/HiTech GLCD for pic18f4680.h
//After we finished with the buffer, we start to write in to the controllers. First, in the left controller.

	DI=0;		// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xC0;						// Instruction for the starting address: 0b11000000 - it is the top of the display...
		Enable();						//... and, of course, rise ENABLE.
		CS1=1;	// Pin RB3 (CS1) is going on logical 1 to switch ON left controller... 			Pogledaj napomenu na dnu strane!
		CS2=0;	// ... and RB2 (CS2) is going on logical 0 to switch OFF right controller...
			Enable();					// ... and, of course, rise ENABLE for starting address to be written.

	LATC=0xB8;						// Now, we are writting byte of the instruction for the row in which we are going to write: 0b10111000...
	LATC+=Row;					// ... whom we add the starting row from the top of display...
		Enable();						// ... and, of course, rise ENABLE for X-address to be written.

	LATC=0x40;				// After that, we are writting the instruction for the Y-address – the starting column in which we are going to write: 0b01000000 – the column zero...
		Enable();				// ... and, of course, rise ENABLE for Y-address to be written.

	DI=1;	// Now, we are going to write bytes in GLCD, so pin D/I (data/instruction) is going on logical 1: data.

	for(Index=0;Index<=63;Index++)
	{
		LATC=Buffer[Index];		// We are taking one by one byte from buffer Buffer[] from place Buffer[Index] and write it in port D...
		Enable();							// ... and, of course, rise ENABLE for data to be written in GLCD.
// NOTE: everytime the byte is written, controller by himself increments the Y-address by one so we don`t need to increment the Y-address!
	}

//Continuing to write, but now in the right controller.

	DI=0;			// Put pin D/I (data/instruction) at logical 0: instruction...
	RW=0;			// ... and R/W pin (read/write) at logical 0: writting.
	LATC=0xC0;							// Again, instruction for the starting address: 0b11000000 - it is the top of the display...
		Enable();							//... and, of course, rise ENABLE.
	 		CS1=0;	// Pin RB3 (CS1) is going on logical 0 to switch OFF left controller...
			CS2=1;	// ... and RB2 (CS2) is going on logical 1 to switch ON right controller...
			Enable();						// ... and, of course, rise ENABLE for starting address to be written.

	LATC=0xB8;					// Again, we are writting byte of the instruction for the row in which we are going to write: 0b10111000...
	LATC+=Row;				// ... whom we add the starting row from the top of display...
		Enable();					// ... and, of course, rise ENABLE for X-address to be written.

	LATC=0x40;					// After that, we are writting the instruction for the Y-address – the sarting column in which we are going to	write: 0b01000000 – the column zero...
		Enable();					// ... and, of course, rise ENABLE for Y-address to be written.

	DI=1;		// Now, we are going to write bytes in GLCD, so pin D/I (data/instruction) is going on logical 1: data.
	RW=0;		// ... and R/W pin (read/write) at logical 0: writting (just in case).

	  for(Index=64;Index<128;Index++)
	  {
		LATC=Buffer[Index];		// Again, we are taking one by one byte from buffer Buffer[] from place Buffer[Index] and write it in port D...
		Enable();							// ... and, of course, rise ENABLE for data to be written in GLCD.
	  }
	  LATB=0b10000000;			// This line is specially for my EasyPIC3 for port B. It prevents the corresponding diodes not to light, but the GLCD is still showing the data (remember: bit 8 must be ON during the whole time the GLCD is used).
	  LATC=0;						// Like the line before, for port D to stay OFF.
}
//******************************End of function void TextBuff_GLCD(unsigned char Row,  unsigned char Column,  unsigned char Buff_String)
